; ModuleID = 'xdp_kern.c'
source_filename = "xdp_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.StatData = type { i64, i64, i64 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }

@hash_table_map = dso_local global %struct.bpf_map_def { i32 1, i32 4, i32 4, i32 10240, i32 0 }, section "maps", align 4, !dbg !0
@white_table_map = dso_local global %struct.bpf_map_def { i32 1, i32 4, i32 2, i32 2048, i32 0 }, section "maps", align 4, !dbg !104
@stat_map = dso_local global %struct.bpf_map_def { i32 1, i32 4, i32 24, i32 1, i32 0 }, section "maps", align 4, !dbg !114
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !116
@llvm.used = appending global [5 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (%struct.bpf_map_def* @hash_table_map to i8*), i8* bitcast (%struct.bpf_map_def* @stat_map to i8*), i8* bitcast (%struct.bpf_map_def* @white_table_map to i8*), i8* bitcast (i32 (%struct.xdp_md*)* @xdp_main to i8*)], section "llvm.metadata"

; Function Attrs: nounwind
define dso_local i32 @get_seed() local_unnamed_addr #0 !dbg !145 {
  %1 = tail call i64 inttoptr (i64 5 to i64 ()*)() #4, !dbg !151
  %2 = trunc i64 %1 to i32, !dbg !152
  call void @llvm.dbg.value(metadata i32 %2, metadata !150, metadata !DIExpression()), !dbg !153

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hash_table_map", scope: !2, file: !3, line: 28, type: !106, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !103, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_kern.c", directory: "/home/admin-ub/\D0\94\D0\BE\D0\BA\D1\83\D0\BC\D0\B5\D0\BD\D1\82\D1\8B/xdp-tutorial/XDP_syn_cookie")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/admin-ub/\D0\94\D0\BE\D0\BA\D1\83\D0\BC\D0\B5\D0\BD\D1\82\D1\8B/xdp-tutorial/XDP_syn_cookie")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !47, !48, !63, !61, !64, !82}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !45, line: 31, baseType: !46)
!45 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!46 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !45, line: 27, baseType: !7)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !50, line: 163, size: 112, elements: !51)
!50 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!51 = !{!52, !57, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !49, file: !50, line: 164, baseType: !53, size: 48)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 48, elements: !55)
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !{!56}
!56 = !DISubrange(count: 6)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !49, file: !50, line: 165, baseType: !53, size: 48, offset: 48)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !49, file: !50, line: 166, baseType: !59, size: 16, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !60, line: 25, baseType: !61)
!60 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !45, line: 24, baseType: !62)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !66, line: 86, size: 160, elements: !67)
!66 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!67 = !{!68, !70, !71, !72, !73, !74, !75, !76, !77, !79, !81}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !65, file: !66, line: 88, baseType: !69, size: 4, flags: DIFlagBitField, extraData: i64 0)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !45, line: 21, baseType: !54)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !65, file: !66, line: 89, baseType: !69, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !65, file: !66, line: 96, baseType: !69, size: 8, offset: 8)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !65, file: !66, line: 97, baseType: !59, size: 16, offset: 16)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !65, file: !66, line: 98, baseType: !59, size: 16, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !65, file: !66, line: 99, baseType: !59, size: 16, offset: 48)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !65, file: !66, line: 100, baseType: !69, size: 8, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !65, file: !66, line: 101, baseType: !69, size: 8, offset: 72)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !65, file: !66, line: 102, baseType: !78, size: 16, offset: 80)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !60, line: 31, baseType: !61)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !65, file: !66, line: 103, baseType: !80, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !60, line: 27, baseType: !47)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !65, file: !66, line: 104, baseType: !80, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !84, line: 25, size: 160, elements: !85)
!84 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !83, file: !84, line: 26, baseType: !59, size: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !83, file: !84, line: 27, baseType: !59, size: 16, offset: 16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !83, file: !84, line: 28, baseType: !80, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !83, file: !84, line: 29, baseType: !80, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !83, file: !84, line: 31, baseType: !61, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !83, file: !84, line: 32, baseType: !61, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !83, file: !84, line: 33, baseType: !61, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !83, file: !84, line: 34, baseType: !61, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !83, file: !84, line: 35, baseType: !61, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !83, file: !84, line: 36, baseType: !61, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !83, file: !84, line: 37, baseType: !61, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !83, file: !84, line: 38, baseType: !61, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !83, file: !84, line: 39, baseType: !61, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !83, file: !84, line: 40, baseType: !61, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !83, file: !84, line: 55, baseType: !59, size: 16, offset: 112)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !83, file: !84, line: 56, baseType: !78, size: 16, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !83, file: !84, line: 57, baseType: !59, size: 16, offset: 144)
!103 = !{!0, !104, !114, !116, !122, !128, !136}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "white_table_map", scope: !2, file: !3, line: 37, type: !106, isLocal: false, isDefinition: true)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !107, line: 154, size: 160, elements: !108)
!107 = !DIFile(filename: "/usr/include/bpf/bpf_helpers.h", directory: "")
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !107, line: 155, baseType: !7, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !106, file: !107, line: 156, baseType: !7, size: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !106, file: !107, line: 157, baseType: !7, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !106, file: !107, line: 158, baseType: !7, size: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !106, file: !107, line: 159, baseType: !7, size: 32, offset: 128)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "stat_map", scope: !2, file: !3, line: 46, type: !106, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 269, type: !118, isLocal: false, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !120)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!120 = !{!121}
!121 = !DISubrange(count: 4)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !124, line: 109, type: !125, isLocal: true, isDefinition: true)
!124 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "")
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!44}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !124, line: 73, type: !130, isLocal: true, isDefinition: true)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !63, !134, !134, !44}
!133 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !124, line: 51, type: !138, isLocal: true, isDefinition: true)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!63, !63, !134}
!141 = !{i32 7, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{i32 1, !"wchar_size", i32 4}
!144 = !{!"clang version 10.0.0-4ubuntu1 "}
!145 = distinct !DISubprogram(name: "get_seed", scope: !146, file: !146, line: 11, type: !147, scopeLine: 11, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !149)
!146 = !DIFile(filename: "./hash_cookie.h", directory: "/home/admin-ub/\D0\94\D0\BE\D0\BA\D1\83\D0\BC\D0\B5\D0\BD\D1\82\D1\8B/xdp-tutorial/XDP_syn_cookie")
!147 = !DISubroutineType(types: !148)
!148 = !{!47}
!149 = !{!150}
!150 = !DILocalVariable(name: "sec", scope: !145, file: !146, line: 12, type: !47)
!151 = !DILocation(line: 12, column: 18, scope: !145)
!152 = !DILocation(line: 12, column: 17, scope: !145)
!153 = !DILocation(line: 0, scope: !145)
!154 = !DILocation(line: 15, column: 16, scope: !145)
!155 = !DILocation(line: 15, column: 5, scope: !145)
!156 = distinct !DISubprogram(name: "hash_sum", scope: !146, file: !146, line: 20, type: !157, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !160)
!157 = !DISubroutineType(types: !158)
!158 = !{!44, !159, !61}
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!160 = !{!161, !162, !163}
!161 = !DILocalVariable(name: "buf", arg: 1, scope: !156, file: !146, line: 20, type: !159)
!162 = !DILocalVariable(name: "sid", arg: 2, scope: !156, file: !146, line: 20, type: !61)
!163 = !DILocalVariable(name: "hash", scope: !156, file: !146, line: 21, type: !44)
!164 = !DILocation(line: 0, scope: !156)
!165 = !DILocation(line: 21, column: 22, scope: !156)
!166 = !DILocation(line: 22, column: 17, scope: !156)
!167 = !DILocation(line: 22, column: 5, scope: !156)
!168 = distinct !DISubprogram(name: "hash_tcp_ip", scope: !146, file: !146, line: 27, type: !169, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !171)
!169 = !DISubroutineType(types: !170)
!170 = !{!47, !47, !47, !61, !61, !47}
!171 = !{!172, !173, !174, !175, !176, !177, !178}
!172 = !DILocalVariable(name: "saddr", arg: 1, scope: !168, file: !146, line: 27, type: !47)
!173 = !DILocalVariable(name: "daddr", arg: 2, scope: !168, file: !146, line: 27, type: !47)
!174 = !DILocalVariable(name: "sport", arg: 3, scope: !168, file: !146, line: 27, type: !61)
!175 = !DILocalVariable(name: "dport", arg: 4, scope: !168, file: !146, line: 27, type: !61)
!176 = !DILocalVariable(name: "seqnum", arg: 5, scope: !168, file: !146, line: 27, type: !47)
!177 = !DILocalVariable(name: "cookie_seed", scope: !168, file: !146, line: 28, type: !47)
!178 = !DILocalVariable(name: "res", scope: !168, file: !146, line: 30, type: !44)
!179 = !DILocation(line: 0, scope: !168)
!180 = !DILocation(line: 12, column: 18, scope: !145, inlinedAt: !181)
!181 = distinct !DILocation(line: 28, column: 25, scope: !168)
!182 = !DILocation(line: 0, scope: !145, inlinedAt: !181)
!183 = !DILocation(line: 30, column: 27, scope: !168)
!184 = !DILocation(line: 30, column: 40, scope: !168)
!185 = !DILocation(line: 30, column: 49, scope: !168)
!186 = !DILocation(line: 30, column: 47, scope: !168)
!187 = !DILocation(line: 0, scope: !156, inlinedAt: !188)
!188 = distinct !DILocation(line: 30, column: 17, scope: !168)
!189 = !DILocation(line: 21, column: 22, scope: !156, inlinedAt: !188)
!190 = !DILocation(line: 22, column: 17, scope: !156, inlinedAt: !188)
!191 = !DILocation(line: 32, column: 22, scope: !168)
!192 = !DILocation(line: 32, column: 35, scope: !168)
!193 = !DILocation(line: 32, column: 45, scope: !168)
!194 = !DILocation(line: 32, column: 59, scope: !168)
!195 = !DILocation(line: 32, column: 68, scope: !168)
!196 = !DILocation(line: 32, column: 42, scope: !168)
!197 = !DILocation(line: 32, column: 66, scope: !168)
!198 = !DILocation(line: 0, scope: !156, inlinedAt: !199)
!199 = distinct !DILocation(line: 32, column: 12, scope: !168)
!200 = !DILocation(line: 21, column: 22, scope: !156, inlinedAt: !199)
!201 = !DILocation(line: 22, column: 17, scope: !156, inlinedAt: !199)
!202 = !DILocation(line: 32, column: 12, scope: !168)
!203 = !DILocation(line: 32, column: 5, scope: !168)
!204 = distinct !DISubprogram(name: "hash_cookie", scope: !146, file: !146, line: 37, type: !205, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !207)
!205 = !DISubroutineType(types: !206)
!206 = !{!47, !47, !47}
!207 = !{!208, !209, !210}
!208 = !DILocalVariable(name: "hash", arg: 1, scope: !204, file: !146, line: 37, type: !47)
!209 = !DILocalVariable(name: "seqnum", arg: 2, scope: !204, file: !146, line: 37, type: !47)
!210 = !DILocalVariable(name: "hash_seed", scope: !204, file: !146, line: 38, type: !47)
!211 = !DILocation(line: 0, scope: !204)
!212 = !DILocation(line: 12, column: 18, scope: !145, inlinedAt: !213)
!213 = distinct !DILocation(line: 38, column: 23, scope: !204)
!214 = !DILocation(line: 0, scope: !145, inlinedAt: !213)
!215 = !DILocation(line: 40, column: 38, scope: !204)
!216 = !DILocation(line: 0, scope: !156, inlinedAt: !217)
!217 = distinct !DILocation(line: 40, column: 29, scope: !204)
!218 = !DILocation(line: 21, column: 22, scope: !156, inlinedAt: !217)
!219 = !DILocation(line: 22, column: 17, scope: !156, inlinedAt: !217)
!220 = !DILocation(line: 40, column: 12, scope: !204)
!221 = !DILocation(line: 40, column: 5, scope: !204)
!222 = distinct !DISubprogram(name: "write_hash_table", scope: !3, file: !3, line: 55, type: !223, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !47, !47}
!225 = !{!226, !227}
!226 = !DILocalVariable(name: "hash", arg: 1, scope: !222, file: !3, line: 55, type: !47)
!227 = !DILocalVariable(name: "key", arg: 2, scope: !222, file: !3, line: 55, type: !47)
!228 = !DILocation(line: 0, scope: !222)
!229 = !{!230, !230, i64 0}
!230 = !{!"int", !231, i64 0}
!231 = !{!"omnipotent char", !232, i64 0}
!232 = !{!"Simple C/C++ TBAA"}
!233 = !DILocation(line: 56, column: 42, scope: !222)
!234 = !DILocation(line: 56, column: 48, scope: !222)
!235 = !DILocation(line: 56, column: 5, scope: !222)
!236 = !DILocation(line: 58, column: 1, scope: !222)
!237 = distinct !DISubprogram(name: "write_white_table", scope: !3, file: !3, line: 62, type: !238, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !242)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !240, !47}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !45, line: 23, baseType: !241)
!241 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!242 = !{!243, !244}
!243 = !DILocalVariable(name: "reg", arg: 1, scope: !237, file: !3, line: 62, type: !240)
!244 = !DILocalVariable(name: "key", arg: 2, scope: !237, file: !3, line: 62, type: !47)
!245 = !DILocation(line: 0, scope: !237)
!246 = !{!247, !247, i64 0}
!247 = !{!"short", !231, i64 0}
!248 = !DILocation(line: 63, column: 43, scope: !237)
!249 = !DILocation(line: 63, column: 49, scope: !237)
!250 = !DILocation(line: 63, column: 5, scope: !237)
!251 = !DILocation(line: 65, column: 1, scope: !237)
!252 = distinct !DISubprogram(name: "stat_white", scope: !3, file: !3, line: 69, type: !253, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !256)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !255, !255, !255}
!255 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !272}
!257 = !DILocalVariable(name: "pass", arg: 1, scope: !252, file: !3, line: 69, type: !255)
!258 = !DILocalVariable(name: "drop", arg: 2, scope: !252, file: !3, line: 69, type: !255)
!259 = !DILocalVariable(name: "tx", arg: 3, scope: !252, file: !3, line: 69, type: !255)
!260 = !DILocalVariable(name: "key", scope: !252, file: !3, line: 70, type: !255)
!261 = !DILocalVariable(name: "kpass", scope: !252, file: !3, line: 71, type: !44)
!262 = !DILocalVariable(name: "kdrop", scope: !252, file: !3, line: 72, type: !44)
!263 = !DILocalVariable(name: "ktx", scope: !252, file: !3, line: 73, type: !44)
!264 = !DILocalVariable(name: "stat", scope: !252, file: !3, line: 74, type: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StatData", file: !267, line: 6, size: 192, elements: !268)
!267 = !DIFile(filename: "./common_struct.h", directory: "/home/admin-ub/\D0\94\D0\BE\D0\BA\D1\83\D0\BC\D0\B5\D0\BD\D1\82\D1\8B/xdp-tutorial/XDP_syn_cookie")
!268 = !{!269, !270, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "KPass", scope: !266, file: !267, line: 7, baseType: !44, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "KDrop", scope: !266, file: !267, line: 8, baseType: !44, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "KTx", scope: !266, file: !267, line: 9, baseType: !44, size: 64, offset: 128)
!272 = !DILocalVariable(name: "new_stat", scope: !252, file: !3, line: 82, type: !266)
!273 = !DILocation(line: 0, scope: !252)
!274 = !DILocation(line: 70, column: 5, scope: !252)
!275 = !DILocation(line: 70, column: 9, scope: !252)
!276 = !DILocation(line: 74, column: 29, scope: !252)
!277 = !DILocation(line: 76, column: 8, scope: !278)
!278 = distinct !DILexicalBlock(scope: !252, file: !3, line: 76, column: 8)
!279 = !DILocation(line: 76, column: 8, scope: !252)
!280 = !DILocation(line: 77, column: 23, scope: !281)
!281 = distinct !DILexicalBlock(scope: !278, file: !3, line: 76, column: 13)
!282 = !{!283, !284, i64 0}
!283 = !{!"StatData", !284, i64 0, !284, i64 8, !284, i64 16}
!284 = !{!"long long", !231, i64 0}
!285 = !DILocation(line: 78, column: 23, scope: !281)
!286 = !{!283, !284, i64 8}
!287 = !DILocation(line: 79, column: 23, scope: !281)
!288 = !{!283, !284, i64 16}
!289 = !DILocation(line: 80, column: 5, scope: !281)
!290 = !DILocation(line: 82, column: 5, scope: !252)
!291 = !DILocation(line: 82, column: 21, scope: !252)
!292 = !DILocation(line: 84, column: 8, scope: !293)
!293 = distinct !DILexicalBlock(scope: !252, file: !3, line: 84, column: 8)
!294 = !DILocation(line: 84, column: 8, scope: !252)
!295 = !DILocation(line: 85, column: 32, scope: !296)
!296 = distinct !DILexicalBlock(scope: !293, file: !3, line: 84, column: 14)
!297 = !DILocation(line: 85, column: 18, scope: !296)
!298 = !DILocation(line: 85, column: 24, scope: !296)
!299 = !DILocation(line: 86, column: 18, scope: !296)
!300 = !DILocation(line: 86, column: 24, scope: !296)
!301 = !DILocation(line: 88, column: 5, scope: !296)
!302 = !DILocation(line: 89, column: 13, scope: !303)
!303 = distinct !DILexicalBlock(scope: !293, file: !3, line: 89, column: 13)
!304 = !DILocation(line: 89, column: 13, scope: !293)
!305 = !DILocation(line: 90, column: 18, scope: !306)
!306 = distinct !DILexicalBlock(scope: !303, file: !3, line: 89, column: 18)
!307 = !DILocation(line: 90, column: 24, scope: !306)
!308 = !DILocation(line: 91, column: 32, scope: !306)
!309 = !DILocation(line: 91, column: 18, scope: !306)
!310 = !DILocation(line: 91, column: 24, scope: !306)
!311 = !DILocation(line: 93, column: 5, scope: !306)
!312 = !DILocation(line: 94, column: 13, scope: !313)
!313 = distinct !DILexicalBlock(scope: !303, file: !3, line: 94, column: 13)
!314 = !DILocation(line: 0, scope: !313)
!315 = !DILocation(line: 94, column: 13, scope: !303)
!316 = !DILocation(line: 0, scope: !293)
!317 = !DILocation(line: 105, column: 5, scope: !252)
!318 = !DILocation(line: 108, column: 1, scope: !252)
!319 = distinct !DISubprogram(name: "xdp_main", scope: !3, file: !3, line: 113, type: !320, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !330)
!320 = !DISubroutineType(types: !321)
!321 = !{!255, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !324)
!324 = !{!325, !326, !327, !328, !329}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !323, file: !6, line: 2857, baseType: !47, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !323, file: !6, line: 2858, baseType: !47, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !323, file: !6, line: 2859, baseType: !47, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !323, file: !6, line: 2861, baseType: !47, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !323, file: !6, line: 2862, baseType: !47, size: 32, offset: 128)
!330 = !{!331, !332, !339, !340, !341, !345, !350, !351, !352, !353, !357, !358, !359, !360, !361, !365, !368}
!331 = !DILocalVariable(name: "ctx", arg: 1, scope: !319, file: !3, line: 113, type: !322)
!332 = !DILocalVariable(name: "Npack", scope: !319, file: !3, line: 114, type: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NetPacket", file: !3, line: 19, size: 256, elements: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !333, file: !3, line: 20, baseType: !322, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4", scope: !333, file: !3, line: 21, baseType: !64, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !333, file: !3, line: 22, baseType: !82, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "eth", scope: !333, file: !3, line: 23, baseType: !48, size: 64, offset: 192)
!339 = !DILocalVariable(name: "ipv4", scope: !319, file: !3, line: 129, type: !64)
!340 = !DILocalVariable(name: "tcp", scope: !319, file: !3, line: 141, type: !82)
!341 = !DILocalVariable(name: "reg", scope: !342, file: !3, line: 150, type: !344)
!342 = distinct !DILexicalBlock(scope: !343, file: !3, line: 148, column: 84)
!343 = distinct !DILexicalBlock(scope: !319, file: !3, line: 148, column: 9)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!345 = !DILocalVariable(name: "new_reg", scope: !346, file: !3, line: 160, type: !240)
!346 = distinct !DILexicalBlock(scope: !347, file: !3, line: 159, column: 32)
!347 = distinct !DILexicalBlock(scope: !348, file: !3, line: 159, column: 16)
!348 = distinct !DILexicalBlock(scope: !349, file: !3, line: 153, column: 31)
!349 = distinct !DILexicalBlock(scope: !342, file: !3, line: 153, column: 12)
!350 = !DILocalVariable(name: "temp_sport", scope: !346, file: !3, line: 171, type: !61)
!351 = !DILocalVariable(name: "temp_saddr", scope: !346, file: !3, line: 176, type: !47)
!352 = !DILocalVariable(name: "temp_eth", scope: !346, file: !3, line: 181, type: !49)
!353 = !DILocalVariable(name: "hash", scope: !354, file: !3, line: 199, type: !47)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 197, column: 32)
!355 = distinct !DILexicalBlock(scope: !356, file: !3, line: 197, column: 16)
!356 = distinct !DILexicalBlock(scope: !349, file: !3, line: 193, column: 14)
!357 = !DILocalVariable(name: "cookie", scope: !354, file: !3, line: 200, type: !47)
!358 = !DILocalVariable(name: "temp_sport", scope: !354, file: !3, line: 212, type: !61)
!359 = !DILocalVariable(name: "temp_saddr", scope: !354, file: !3, line: 217, type: !47)
!360 = !DILocalVariable(name: "temp_eth", scope: !354, file: !3, line: 222, type: !49)
!361 = !DILocalVariable(name: "cookie_table", scope: !362, file: !3, line: 231, type: !364)
!362 = distinct !DILexicalBlock(scope: !363, file: !3, line: 229, column: 37)
!363 = distinct !DILexicalBlock(scope: !355, file: !3, line: 229, column: 21)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!365 = !DILocalVariable(name: "cookie_client", scope: !366, file: !3, line: 240, type: !47)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 234, column: 34)
!367 = distinct !DILexicalBlock(scope: !362, file: !3, line: 234, column: 21)
!368 = !DILocalVariable(name: "reg", scope: !369, file: !3, line: 243, type: !240)
!369 = distinct !DILexicalBlock(scope: !370, file: !3, line: 242, column: 56)
!370 = distinct !DILexicalBlock(scope: !366, file: !3, line: 242, column: 25)
!371 = !DILocation(line: 82, column: 21, scope: !252, inlinedAt: !372)
!372 = distinct !DILocation(line: 260, column: 17, scope: !373)
!373 = distinct !DILexicalBlock(scope: !363, file: !3, line: 259, column: 18)
!374 = !DILocation(line: 82, column: 21, scope: !252, inlinedAt: !375)
!375 = distinct !DILocation(line: 256, column: 17, scope: !362)
!376 = !DILocation(line: 82, column: 21, scope: !252, inlinedAt: !377)
!377 = distinct !DILocation(line: 252, column: 21, scope: !366)
!378 = !DILocation(line: 82, column: 21, scope: !252, inlinedAt: !379)
!379 = distinct !DILocation(line: 248, column: 25, scope: !369)
!380 = !DILocation(line: 82, column: 21, scope: !252, inlinedAt: !381)
!381 = distinct !DILocation(line: 226, column: 17, scope: !354)
!382 = !DILocation(line: 82, column: 21, scope: !252, inlinedAt: !383)
!383 = distinct !DILocation(line: 189, column: 17, scope: !384)
!384 = distinct !DILexicalBlock(scope: !347, file: !3, line: 188, column: 17)
!385 = !DILocation(line: 82, column: 21, scope: !252, inlinedAt: !386)
!386 = distinct !DILocation(line: 185, column: 17, scope: !346)
!387 = !DILocation(line: 0, scope: !319)
!388 = !DILocation(line: 116, column: 45, scope: !319)
!389 = !{!390, !230, i64 0}
